Documents/СправкаОбОтсутствииЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СправкаОбОтсутствииЗадолженности</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цедент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЦессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СправкаОбОтсутствииЗадолженности/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.СправкаОбОтсутствииЗадолженности.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправкаОбОтсутствииЗадолженности.Ссылка КАК Ссылка,
	|	СправкаОбОтсутствииЗадолженности.ВерсияДанных КАК ВерсияДанных,
	|	СправкаОбОтсутствииЗадолженности.ПометкаУдаления КАК ПометкаУдаления,
	|	СправкаОбОтсутствииЗадолженности.Номер КАК Номер,
	|	СправкаОбОтсутствииЗадолженности.Дата КАК Дата,
	|	СправкаОбОтсутствииЗадолженности.Проведен КАК Проведен,
	|	СправкаОбОтсутствииЗадолженности.Договор КАК Договор,
	|	СправкаОбОтсутствииЗадолженности.Должник КАК Должник,
	|	СправкаОбОтсутствииЗадолженности.Цедент КАК Цедент,
	|	СправкаОбОтсутствииЗадолженности.ДатаЦессии КАК ДатаЦессии,
	|	СправкаОбОтсутствииЗадолженности.ДоговорЦессии КАК ДоговорЦессии,
	|	СправкаОбОтсутствииЗадолженности.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	Документ.СправкаОбОтсутствииЗадолженности КАК СправкаОбОтсутствииЗадолженности
	|ГДЕ
	|	СправкаОбОтсутствииЗадолженности.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		Шапка.Параметры.ДатаЦессии = Формат(Выборка.ДатаЦессии, "ДФ=dd.MM.yyyy");
		Шапка.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
